{
  "movies": [
    {
      "Title": "Ricki and the Flash",
      "Year": "2015",
      "Type": "movie",
      "imdbID": "tt3623726",
      "Poster": "https://m.media-amazon.com/images/M/MV5BMTY1NzIxNzkzM15BMl5BanBnXkFtZTgwMzAzNjIzNjE@._V1_SX300.jpg",
      "Genre": "Comedy, Drama, Music",
      "Released": "07 Aug 2015",
      "Runtime": "101 min",
      "Rated": "PG-13",
      "Director": "Jonathan Demme",
      "Writer": "Diablo Cody",
      "Actors": "Meryl Streep, Kevin Kline, Mamie Gummer",
      "Awards": "4 nominations",
      "Plot": "A woman named Linda leaves her family to pursue her dream of being a rock star. And she hasn't achieved the notoriety she hoped for. Her ex-husband calls her to tell her that her daughter suffered a breakdown because her husband left her. She goes back to Indianapolis. But her daughter doesn't exactly welcome her with open arms. But she stays and tries. And her sons also don't welcome her warmly.",
      "id": 1
    },
    {
      "Title": "The Flash",
      "Year": "2014–",
      "Type": "series",
      "imdbID": "tt3107288",
      "Poster": "https://m.media-amazon.com/images/M/MV5BMDIzNzYwNTctZWY4Mi00YjQ2LWI5YWYtMzdmNDgwMGI4Yzk1XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_SX300.jpg",
      "Genre": "Action, Adventure, Drama",
      "Released": "07 Oct 2014",
      "Runtime": "43 min",
      "Rated": "TV-PG",
      "Director": "N/A",
      "Writer": "Greg Berlanti, Geoff Johns, Andrew Kreisberg",
      "Actors": "Grant Gustin, Candice Patton, Danielle Panabaker",
      "Awards": "Nominated for 1 Primetime Emmy. 28 wins & 90 nominations total",
      "Plot": "Barry Allen is a Central City police forensic scientist with a reasonably happy life, despite the childhood trauma of a mysterious red and yellow lightning killing his mother and framing his father. All that changes when a massive particle accelerator accident leads to Barry being struck by lightning in his lab. Coming out of coma nine months later, Barry and his new friends at S.T.A.R labs find that he now has the ability to move at superhuman speed. Furthermore, Barry learns that he is but one of many affected by that event, most of whom are using their powers for evil. Determined to make a difference, Barry dedicates his life to fighting such threats, as The Flash. While he gains allies he never expected, there are also secret forces determined to aid and manipulate him for their own agenda.",
      "totalSeasons": "8",
      "id": 2
    }
  ]
}